snlkuharlocal/src/Documents/ПереводСредств/ПереводСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереводСредств</name>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник_Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник_Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник_Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель_Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПС</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/ПереводСредств/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)		ЕстьИзменения		=Модифицированность();
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		
		Если Отказ Тогда Возврат КонецЕсли; 		
	КонецЕсли;	
	
	Если Отказ Тогда Возврат КонецЕсли;
		
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);	
	КонецЕсли;
	//+HELP-2684 20250204 Михайловский
	Если ЗначениеЗаполнено(Источник_Касса.ПодразделениеДляУчета) И (Дата>='20241201') И НЕ (Источник_Подразделение	= Источник_Касса.ПодразделениеДляУчета)  Тогда
		Источник_Подразделение	= Источник_Касса.ПодразделениеДляУчета;
	КонецЕсли;
	Если ЗначениеЗаполнено(Получатель_Касса.ПодразделениеДляУчета) И (Дата>='20241201') И НЕ (Получатель_Подразделение	= Получатель_Касса.ПодразделениеДляУчета)  Тогда
		Получатель_Подразделение	= Получатель_Касса.ПодразделениеДляУчета;
	КонецЕсли;
	//-HELP-2684 20250204 Михайловский
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ВалютаУпр			= ПараметрыСеанса.ВалютаУпр_2009;	
	СуммаУпр			= глПересчет(Сумма,Валюта,Дата,ВалютаУпр,Дата);	
	//крохин начало
	//для астрахани, подразделение без своей базы
	//Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение ИЛИ Источник_Подразделение=ПараметрыСеанса.ЭтотУзел.Подразделение  Тогда
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение ИЛИ Источник_Подразделение.Ведущее=ПараметрыСеанса.ЭтотУзел.Подразделение.Ведущее  Тогда
	//крохин конец
		Движение 					= Движения.ДенежныеСредства.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		
		Движение.БанковскийСчет 	= Источник_Касса;
		Движение.Валюта 			= Валюта;
		
		Движение.Сумма 				= Сумма;
		Если Дата>='20090101' Тогда
			Движение.СуммаУпр		= СуммаУпр;		
		КонецЕсли;		
		
		Движение.СтатьяДДС 			= СтатьяДДС;
		Движение.Отправитель 		= Получатель_Касса;
			//крохин начало
		Движение.Комментарий        = Комментарий;
		//крохин конец
		
		Движение.СуммаДокумента		= Сумма;
		Движение.ВалютаДокумента	= Валюта;
		//+HELP-2684 20250204 Михайловский
		Если ЗначениеЗаполнено(Источник_Касса.ПодразделениеДляУчета) И (Дата>='20241201') И НЕ(Источник_Касса.ПодразделениеДляУчета	= Источник_Подразделение)  Тогда
			Движение.Подразделение	= Источник_Касса.ПодразделениеДляУчета;
		Иначе
			Движение.Подразделение 		= Источник_Подразделение;
		КонецЕсли;
		//-HELP-2684 20250204 Михайловский
	КонецЕсли;	
		//крохин начало
	//для астрахани, подразделение без своей базы
	Если ПараметрыСеанса.ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение ИЛИ Получатель_Подразделение.Ведущее=ПараметрыСеанса.ЭтотУзел.Подразделение.Ведущее Тогда
		//крохин конец
		Движение 					= Движения.ДенежныеСредства.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		
		Движение.БанковскийСчет 	= Получатель_Касса;
		Движение.Валюта 			= Валюта;
		
		Движение.Сумма 				= Сумма;
		Если Дата>='20090101' Тогда
			Движение.СуммаУпр		= СуммаУпр;		
		КонецЕсли;
		
		Движение.СуммаДокумента		= Сумма;		
		Движение.ВалютаДокумента	= Валюта;
		
		Движение.СтатьяДДС 			= СтатьяДДС;
		Движение.Отправитель 		= Источник_Касса;
			//крохин начало
		Движение.Комментарий        = Комментарий;
		//крохин конец

		//+HELP-2684 20250204 Михайловский
		Если ЗначениеЗаполнено(Получатель_Касса.ПодразделениеДляУчета) И (Дата>='20241201') И НЕ(Получатель_Касса.ПодразделениеДляУчета	= Получатель_Подразделение)  Тогда
			Движение.Подразделение	= Получатель_Касса.ПодразделениеДляУчета;
		Иначе
			Движение.Подразделение 		= Получатель_Подразделение;
		КонецЕсли;
		//-HELP-2684 20250204 Михайловский
	КонецЕсли; 
	
	Если ОбменДанными.Загрузка Тогда
		Движения.ДенежныеСредства.Записать();	
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор	= Неопределено;
	Курс	= 0;	
	Дата	= Неопределено;
	//крохин начало
	СтатьяДДС=Справочники.СтатьиЗатрат.НайтиПоКоду("100 002");  //транзит касса-касса
	//крохин конец

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
